# 2 Задайте список. Напишите программу, которая определит, присутствует ли в заданном списке
# строк некое число.

a = [1, 2, 3, 4, 5, 6, 7]
i = int(input('Input the number:'))
print('yes') if i in a else print('no')
