# 3 Напишите программу, которая определит позицию второго вхождения строки в списке либо
# сообщит, что её нет.
# Пример:
# - список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# - список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# - список: [], ищем: "123", ответ: -1

lst = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
y = "qwe"

posit = lambda lst, str1: [n for n, i in enumerate(lst) if str1 == i][1]
try:
    print(posit(lst, y))
except IndexError:
    print('-1')
